blog-posts/2004-02-27-public-key-needed-for-xemacs-packages.org
#+TITLE: Public key needed for XEmacs packages

February 27th, 2004 -
[[http://sachachua.com/blog/p/1786][http://sachachua.com/blog/p/1786]]

I was getting “Couldn't check signature” errors on XEmacs. I
 uncommented the mailto keyserver in my ~/.gnupg/gpg.conf and now things
work.
 The public key needed is here:

#+BEGIN_EXAMPLE
    -----BEGIN PGP PUBLIC KEY BLOCK-----
    Version: PGP Key Server 0.9.5

    mQGiBD5bymERBADX0PmDpRvw9a7D1M7gE/KA6ofrYFuy1+r9SzJ9vpdYC8B8B1ip
    QDaTNA3F2euz5BkNal2m3MF7TLXItoojd0QEoIMZjpka17qtXpE5WPhdTa+sgN10
    1o/uffHIkRCnjudY/lMtPrDtAVnNZsD7Yxs4zltw7ZCiwnJYkY7wuW6XEwCg97NY
    N1N3bw8n214at/a6J4tAQt0D/1TEDSlpEoKuS2YJW+seZB7IoDiTeG/6IQwN5N34
    XFrRbT00ttWsQSKUlnhkec0HXJr06GAsSP8+ZxI5ULRmHWB6FDvhE5bllmQyQ1VZ
    1GaPhIcQcNTC7dpM6SVpG2JjTZ0IHxLGPUby20maFBwAmFSGHoa8rS/fAA0XOW/r
    wWrwBACG5igwGBSt6U/yGdvrXM0B9Kg6oYj8KZNI2WNV/CpH+7R+rAuasvEGtFJ+
    +2YwHr5rnhvLnCCJbsbkhvG0fjdZNnr1OVljgnR99sjmY9B2rzHwOXcDyM4exRxB
    p5neVEF7nGbCh0oVcxUNr50qY+kmBfGdI3+tI9YUbbmjgk2QerRBTm9yYmVydCBL
    b2NoIChYRW1hY3MgcGFja2FnZS1yZWxlYXNlIG1hbmFnZXIpIDx2aXRlbm9AeGVt
    YWNzLm9yZz6IXwQTEQIAHwUCPlvKYQUJA8JnAAQLBwMCAxUCAwMWAgECHgECF4AA
    CgkQgu3ywdHdhM3qmACgqWqMvO9wBKi5vGVp/uGKrIVoQqoAninfPKIii17/LeWC
    D5I3CeD48ct5uQENBD5bymUQBACnFB0BchSQEQeQvEdXs45hxKlW39YqmnTmFClP
    P2XJM/f9kWOL4e01/B+2tP/o8yrkS3C7OR1p8llIHUGnZTGW0sKn3/OLdw1c0eFY
    8dCVHnoRnvqn67ffQ4Lqk56Tm96OtK78sJpy9Vj+UhwUdtdDNyNQiWREtsJDE2Qd
    MpK++wADBQP+P1Pz1vJQUMj7OqdojcLCRO3hosx5En21hC3ZL3h0Mnh54yuJxlNl
    Q1zRoiufzG1HSgBZLUsnXxDZSiWSNKnf4gWidrbnq0dQlci4knxB5FfmY3hDYkvR
    KA6+TQs+8vASXnRWArLXAthpl+kv5iMCFBhIF7aNY12/PGIhtu4At7CITAQYEQIA
    DAUCPlvKZQUJA8JnAAAKCRCC7fLB0d2EzYrGAKDdVoyugIlwLzHl4hzxLKzBkWR1
    7wCgp9uaH8pfFUr70S2bALwPDdy/fXs=
    =1HP3
    -----END PGP PUBLIC KEY BLOCK-----
#+END_EXAMPLE

The mailto server returned the key to me as an attachment. I pressed
 pipe on the MIME part and passed it to gpg ---import.

E-Mail from Server Administrator
